app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "R0cr2mUIoqZ-c4HKmZnvrQ"], ["updated_at", "2019-06-06 22:25:59.569079"], ["id", 3]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!